In [ ]:
# Inserting into the MySQL database will need 2 packages : SQLAlchemy and PyMySQL connector
# SQLAlchemy is used by Python to interact with relational databases
# PyMySQL connector is used by SQlAlchemy to establish a connection to the MySQL database
# First of All, check if SQLAlchemy or MySQL connector, is installed with the below command :
%pip list
# The output will be a list of installed packages. If the required packages are absent, you can install them with the below command :

In [31]:
pip install -v sqlalchemy

Using pip 24.2 from C:\Users\USER\anaconda3\Lib\site-packages\pip (python 3.12)
Requirement already satisfied: sqlalchemy in c:\users\user\anaconda3\lib\site-packages (2.0.34)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
# install mysql connector
pip install -v pymysql

In [49]:
# Now import the  create_engine module from the sqlachemy package. This will interact with the MySQL database
from sqlalchemy import create_engine

In [75]:
#import the pymsql package. This will aid SqlAlchemy connect to the MySQL database
import pymysql

In [53]:
# Import the pandas package. This will read the csv file into a dataframe
import pandas as pd

In [55]:
csvdata=pd.read_csv('C:\\Users\\USER\\Downloads\\WalletExport.csv')
# Note : The double backslash "\\" is necessary in windows systems to indicate that the backslash is really intended
# to be present in the file location

In [57]:
# Now use the head() method of the pandas to view the top five rows of the dataframe and see the columns
csvdata.head()

,api_id,operation,type,amount,commission,disco,balance_before,balance_after,created_at,ref,...,Phone,Customer_name,Meter,Account_name,Account_num,Bank,ID,Disco,Bank_code,Reference
0,175,credit,commission,300.0,0.0,JOS,27965.48,28265.48,2025-06-05T19:10:15.000Z,justbeta548512646378,...,NaN,NaN,"""undefined""","""undefined""","""undefined""","""undefined""","""200732691""","""JOS""","""undefined""","""justbeta548512646378"""
1,175,debit,vend,15000.0,0.0,JOS,521645.65,506645.65,2025-06-05T19:10:06.000Z,justbeta548512646378,...,NaN,NaN,"""undefined""","""undefined""","""undefined""","""undefined""","""200732633""","""JOS""","""undefined""","""justbeta548512646378"""
2,175,credit,commission,100.0,0.0,JOS,27865.48,27965.48,2025-06-05T18:21:06.000Z,justbeta682480648111,...,NaN,NaN,"""undefined""","""undefined""","""undefined""","""undefined""","""200706138""","""JOS""","""undefined""","""justbeta682480648111"""
3,175,debit,vend,5000.0,0.0,JOS,526645.65,521645.65,2025-06-05T18:20:58.000Z,justbeta682480648111,...,NaN,NaN,"""undefined""","""undefined""","""undefined""","""undefined""","""200706055""","""JOS""","""undefined""","""justbeta682480648111"""
4,175,credit,commission,20.0,0.0,JOS,27845.48,27865.48,2025-06-05T16:34:08.000Z,justbeta212645507226,...,NaN,NaN,"""undefined""","""undefined""","""undefined""","""undefined""","""200669217""","""JOS""","""undefined""","""justbeta212645507226"""

In [59]:
# Not all the columns were displayed because of the large number in the dataframe
# We need to see all the columns in order to choose relevant columns to insert into the database.
# The command to see all the columns , is shown below :
pd.set_option('display.max_columns',None)

In [61]:
# Now retry the head command
csvdata.head()

,api_id,operation,type,amount,commission,disco,balance_before,balance_after,created_at,ref,id,Phone,Customer_name,Meter,Account_name,Account_num,Bank,ID,Disco,Bank_code,Reference
0,175,credit,commission,300.0,0.0,JOS,27965.48,28265.48,2025-06-05T19:10:15.000Z,justbeta548512646378,200732691,NaN,NaN,"""undefined""","""undefined""","""undefined""","""undefined""","""200732691""","""JOS""","""undefined""","""justbeta548512646378"""
1,175,debit,vend,15000.0,0.0,JOS,521645.65,506645.65,2025-06-05T19:10:06.000Z,justbeta548512646378,200732633,NaN,NaN,"""undefined""","""undefined""","""undefined""","""undefined""","""200732633""","""JOS""","""undefined""","""justbeta548512646378"""
2,175,credit,commission,100.0,0.0,JOS,27865.48,27965.48,2025-06-05T18:21:06.000Z,justbeta682480648111,200706138,NaN,NaN,"""undefined""","""undefined""","""undefined""","""undefined""","""200706138""","""JOS""","""undefined""","""justbeta682480648111"""
3,175,debit,vend,5000.0,0.0,JOS,526645.65,521645.65,2025-06-05T18:20:58.000Z,justbeta682480648111,200706055,NaN,NaN,"""undefined""","""undefined""","""undefined""","""undefined""","""200706055""","""JOS""","""undefined""","""justbeta682480648111"""
4,175,credit,commission,20.0,0.0,JOS,27845.48,27865.48,2025-06-05T16:34:08.000Z,justbeta212645507226,200669217,NaN,NaN,"""undefined""","""undefined""","""undefined""","""undefined""","""200669217""","""JOS""","""undefined""","""justbeta212645507226"""

In [ ]:
# From the dataframe, the required columns for analysis are :
#["operation","type","amount","disco","created_at","ref"]

In [ ]:
# We need a dataframe with the required columns
# We can either drop the unnecessary  columns with this command :
# csvdata.drop(columns=["api_id","commission","balance_before",".......,up to the fifteenth column"],inplace=True) 
# or we can create a new dataframe by picking the relevant columns from the original dataframe.
# Option 2 will be easier ( in my opinion ) , and can be accomplished thus:

In [63]:
selected_df=csvdata[["operation","type","amount","disco","created_at","ref"]]
# Do not forget the double square brackets [[]]

In [65]:
#viewing the top rows of newly created dataframe
selected_df.head()

,operation,type,amount,disco,created_at,ref
0,credit,commission,300.0,JOS,2025-06-05T19:10:15.000Z,justbeta548512646378
1,debit,vend,15000.0,JOS,2025-06-05T19:10:06.000Z,justbeta548512646378
2,credit,commission,100.0,JOS,2025-06-05T18:21:06.000Z,justbeta682480648111
3,debit,vend,5000.0,JOS,2025-06-05T18:20:58.000Z,justbeta682480648111
4,credit,commission,20.0,JOS,2025-06-05T16:34:08.000Z,justbeta212645507226

In [67]:
#viewing the shape of the two dataframes to check that the rows are complete
csvdata.shape

(105008, 21)

In [69]:
selected_df.shape

(105008, 6)

In [71]:
# In the selected_df dataframe, the columns : "type" , "disco"  and "created_at", will be renamed to "operation_type", "transaction_type"  and "transaction_time" 
#for better understanding
# The command for that is
selected_df.rename(columns={"type":"operation_type","disco":"transaction_type","created_at":"transaction_time"},inplace=True)

C:\Users\USER\AppData\Local\Temp\ipykernel_7328\1453540414.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  selected_df.rename(columns={"type":"operation_type","disco":"transaction_type","created_at":"transaction_time"},inplace=True)

In [73]:
selected_df.head()

,operation,operation_type,amount,transaction_type,transaction_time,ref
0,credit,commission,300.0,JOS,2025-06-05T19:10:15.000Z,justbeta548512646378
1,debit,vend,15000.0,JOS,2025-06-05T19:10:06.000Z,justbeta548512646378
2,credit,commission,100.0,JOS,2025-06-05T18:21:06.000Z,justbeta682480648111
3,debit,vend,5000.0,JOS,2025-06-05T18:20:58.000Z,justbeta682480648111
4,credit,commission,20.0,JOS,2025-06-05T16:34:08.000Z,justbeta212645507226

In [85]:
selected_df

,operation,operation_type,amount,transaction_type,transaction_time,ref
0,credit,commission,300.0,JOS,2025-06-05T19:10:15.000Z,justbeta548512646378
1,debit,vend,15000.0,JOS,2025-06-05T19:10:06.000Z,justbeta548512646378
2,credit,commission,100.0,JOS,2025-06-05T18:21:06.000Z,justbeta682480648111
3,debit,vend,5000.0,JOS,2025-06-05T18:20:58.000Z,justbeta682480648111
4,credit,commission,20.0,JOS,2025-06-05T16:34:08.000Z,justbeta212645507226
...,...,...,...,...,...,...
105003,credit,commission,54.0,JOS,2024-01-15T13:09:02.000Z,justbeta981550673502
105004,debit,vend,3000.0,JOS,2024-01-15T13:09:00.000Z,justbeta981550673502
105005,credit,commission,18.0,JOS,2024-01-15T12:47:16.000Z,justbeta054635060626
105006,debit,vend,1000.0,JOS,2024-01-15T12:47:11.000Z,justbeta054635060626
105007,credit,transfer_topup,5000.0,NaN,2024-01-15T11:32:32.000Z,MNFY|68|20240115123219|160400

In [ ]:
# A table was now created in the database to store the imported records
# Special care was taken to map the column names in the database table, to the column names of the dataframe
# The code to create the table is below:

In [89]:
"""
create table provider_records
(record_id int auto_increment primary key,
operation varchar(50),
operation_type varchar(50),
amount varchar(50),
transaction_type varchar(50),
transaction_time timestamp,
ref varchar(80));
"""

'\ncreate table provider_records\n(record_id int auto_increment primary key,\noperation varchar(50),\noperation_type varchar(50),\namount varchar(50),\ntransaction_type varchar(50),\ntransaction_time timestamp,\nref varchar(80));\n'

In [79]:
#The transaction_time column has a date in the 'YYYY-MM-DD%THH:MI:SS%Z'
# This format is not recognized by MySQl as a valid timestamp
# A valid timestamp is in the following format : YYYY-MM-DD HH:MI:SS'
# So the timestamp column will have to be reformated, using the replace function, which has been chained, in order to use it multiple times, as below :
selected_df['transaction_time'] = selected_df['transaction_time'].str.replace('T', ' ').str.replace('.000Z', '')

C:\Users\USER\AppData\Local\Temp\ipykernel_7328\1993903827.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  selected_df['transaction_time'] = selected_df['transaction_time'].str.replace('T', ' ').str.replace('.000Z', '')

In [81]:
selected_df

,operation,operation_type,amount,transaction_type,transaction_time,ref
0,credit,commission,300.0,JOS,2025-06-05 19:10:15,justbeta548512646378
1,debit,vend,15000.0,JOS,2025-06-05 19:10:06,justbeta548512646378
2,credit,commission,100.0,JOS,2025-06-05 18:21:06,justbeta682480648111
3,debit,vend,5000.0,JOS,2025-06-05 18:20:58,justbeta682480648111
4,credit,commission,20.0,JOS,2025-06-05 16:34:08,justbeta212645507226
...,...,...,...,...,...,...
105003,credit,commission,54.0,JOS,2024-01-15 13:09:02,justbeta981550673502
105004,debit,vend,3000.0,JOS,2024-01-15 13:09:00,justbeta981550673502
105005,credit,commission,18.0,JOS,2024-01-15 12:47:16,justbeta054635060626
105006,debit,vend,1000.0,JOS,2024-01-15 12:47:11,justbeta054635060626
105007,credit,transfer_topup,5000.0,NaN,2024-01-15 11:32:32,MNFY|68|20240115123219|160400

In [45]:
# We now create an "engine" or connection to the MySQL database
# The required parameters are the database name, username and password
# create sqlalchemy engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="user_name",
                               pw="user_password",
                               db="database_name"))

In [ ]:
# Note that in the method above, the term "localhost" will only be used when the database is located on the computer you are writing the code
# When the database is located on a separate computer or remote server you use the ip address instead of localhost
# Also note that the if the database is not using the default port number, 3306 in the case of MySQL, you have to input it after the ipaddress or localhost
# Eg "....localhost:3307/{db"..."

In [83]:
# Insert whole DataFrame into the  MySQL table which is called provider_records
selected_df.to_sql('provider_records', con = engine, if_exists = 'append',index=False)

105008

In [85]:
# A check is necessary to see if all the rows in the dataframe have been inserted.
# The number of rows and columns of a dataframe are seen by calling the shape property
selected_df.shape

(105008, 6)

In [ ]:
# The shape property indicates that the dataframe has 105,008 rows and 6 columns

In [ ]:
# The sql command to check how many rows are in the table after inserting is shown below
# select count(*) from provider_records